INITIAL_TEXT = (
    'Это бот производственного отдела по эксплуатации КС.\n'
    'Вы инициировали возможность бота отправлять Вам личные сообщения.\n'
    'Если Вы являетесь начальником ГКС нажмите /gks'
)

NEW_GROUP_TEXT = (
    'Регламент расследования АО ГПА:'
    'что-то там ...что-то там...'
)

HELP_TEXT = (
    'Для внесения данных о начальнике ГКС нажмите /gks\n\n'
    'Для отправки инструкций по созданию рабочего чата нажмите /ao\n\n'
    'Для просмотра списка зарегистрированных пользователей нажмите /users\n\n'
    'Для сброса настроек клавиатуры нажмите /reset'
)

MANUAL = (
    'В рамках расследования произошедшего отказа необходимо:\n'
    '1. Сразу после отказа (в течение 30 минут) и получения оперативной информации об отказе от сменного персонала, анализе трендов и осмотре ГПА (при необходимости) предоставить в группу сообщение в следующей форме: «При работе ГПА на режиме Магистраль произошёл АО с расшифровкой в САУ ГПА  «_». При осмотре ГПА обнаружено _. При анализе трендов отмечено _. (и другие оперативно выявленные причины и факторы). Ведётся расследование. Для восстановления режима ТТР ГТС выполнен пуск ГПА ст. № за  час(ов)  минут.»\n'
    '2. В течение 2 рабочих часов направить в группу подписанное оперативное донесение об отказе.\n'
    '3. В течение 4 рабочих часов направить в группу:\n'
    '  - тренды, события, хронология отказа, фото повреждённых (отказавших) узлов;\n'
    '  - скан-копии объяснительных персонала, непосредственно участвовавшего в событиях, связанных с отказом (сменный персонал - обязательно, персонал АиМО и ЭВС - в случае необходимости).\n'
    '4. В течении первых 4 часов после отказа предоставить в группу план мероприятий (технологическую карту) по расследованию отказа с распределением по направлениям деятельности ГКС, АиМО, ЭВС (как пример: подшипники не разбираются, пока не проверено оборудование АиМО, если был резкий заброс или нестабильные показания параметра по трендам).\n'
    '5. Ежедневно направлять информацию о выполненных работах, выявленных неисправностях с фотоотчётом о выполнении этапов работ, а также план работ на следующий день.\n'
    '6. При установлении причины отказа четко определить причинно-следственную связь между выявленными неисправностями и внешними проявлениями отказа.\n'
    '7. В течение 2-х календарных дней предоставить в группу акт расследования отказа установленной формы, содержащий причины отказа, предпосылки возникновения отказа и факторы, способствующие развитию отказа, а также перечень проработанных мероприятий по недопущению повторных отказов.\n'
    '8. Обеспечить оперативное исполнение указаний специалистов ПОпоКС, направленных на определение причин отказа.\n'
    '9. Обеспечить оперативное устранение замечаний специалистов ПОпоКС к представляемым материалам расследования.\n'
    '10. Продление расследования осуществлять в соответствии с требованиями п.8.12 Положения-ИТЦ-1551-2021.'
)

REMAINDER = (
    'Прошу предоставить информацию о выполненных работах, '
    'выявленных неисправностях с фотоотчётом, '
    'а также план работ на следующий день.'
)