INITIAL_TEXT = (
    'Вы активировали возможность бота отправлять Вам сообщения.\n'
    'Для прохождения процедуры регистрации нажмите /registration'
)

NEW_GROUP_TEXT = (
    'Для выполнения ботом своих функций Вам необходимо предоставить ему права администратора.\n'
    'Сообщение с инструкцией по расследованию отказа закреплено в "шапке" чата'
)

HELP_ADMIN = (
    'Изменение своей учетной записи /admin\n\n'
    'Просмотр администраторов /admins\n\n'
    'Просмотр пользователей /users\n\n'
    'Просмотр текущих задач /review\n\n'
    'Выгрузка текущих задач на почту /mail\n\n'
    'Просмотр статистики АО(ВНО) /stats\n\n'
    'Отправка инструкций по созданию рабочего чата /ao\n\n'
    'Отмена рассылки уведомлений (для группы) /unsub\n\n'
    'Включение рассылки уведомлений (для группы) /sub\n\n'
    'Отправка сообщения об ошибке /bugs'
)

HELP_USER = (
    'Изменение регистрационных данных /registration\n\n'
    'Просмотр текущих задач\вопросов\проблем /review\n\n'
    'Новая задача\вопрос\проблема /task\n\n'
    'Отправка сообщения об ошибке /bugs'
)

MANUAL = (
    'В рамках расследования произошедшего отказа необходимо:\n\n'
    '1. Сразу после отказа (в течение <b>30 минут</b>) и получения оперативной информации об отказе от сменного персонала, анализе трендов и осмотре ГПА (при необходимости) предоставить в группу сообщение в следующей форме:\n\n'
    '<i>«При работе ГПА на режиме Магистраль произошёл АО с расшифровкой в САУ ГПА  «_».\nПри осмотре ГПА обнаружено _.\nПри анализе трендов отмечено _. (и другие оперативно выявленные причины и факторы).\nВедётся расследование. Для восстановления режима ТТР ГТС выполнен пуск ГПА ст.№_ за __час(ов)__минут.»</i>\n\n'
    '2. В течение <b>2</b> рабочих часов направить в группу подписанное оперативное донесение об отказе.\n\n'
    '3. В течение <b>4</b> рабочих часов направить в группу:\n\n'
    '  - тренды, события, хронология отказа, фото повреждённых (отказавших) узлов;\n\n'
    '  - скан-копии объяснительных персонала, непосредственно участвовавшего в событиях, связанных с отказом (сменный персонал - обязательно, персонал АиМО и ЭВС - в случае необходимости).\n\n'
    '4. В течении первых <b>4-х</b> часов после отказа предоставить в группу план мероприятий (технологическую карту) по расследованию отказа с распределением по направлениям деятельности ГКС, АиМО, ЭВС (как пример: подшипники не разбираются, пока не проверено оборудование АиМО, если был резкий заброс или нестабильные показания параметра по трендам).\n\n'
    '5. <b>Ежедневно</b> направлять информацию о выполненных работах, выявленных неисправностях с фотоотчётом о выполнении этапов работ, а также план работ на следующий день.\n\n'
    '6. При установлении причины отказа четко определить причинно-следственную связь между выявленными неисправностями и внешними проявлениями отказа.\n\n'
    '7. Причину и мероприятия по недопущению подобных отказов предварительно направить в группу для согласования специалистом по направлению деятельности и заместителем начальника ПОпоКС.\n\n'
    '8. В течение <b>2-х</b> календарных дней предоставить в группу акт расследования отказа установленной формы, содержащий причины отказа, предпосылки возникновения отказа и факторы, способствующие развитию отказа, а также перечень проработанных мероприятий по недопущению повторных отказов.\n\n'
    '9. Обеспечить оперативное исполнение указаний специалистов ПОпоКС, направленных на определение причин отказа.\n\n'
    '10. Обеспечить оперативное устранение замечаний специалистов ПОпоКС к представляемым материалам расследования.\n\n'
    '11. Продление расследования осуществлять в соответствии с требованиями п.8.12 Положения-ИТЦ-1551-2021.'
)

REPORT = (
    'При работе ГПА на режиме Магистраль произошёл АО с расшифровкой в САУ ГПА "_". '
    'При осмотре ГПА обнаружено _. При анализе трендов отмечено _. '
    '(и другие оперативно выявленные причины и факторы). Ведётся расследование. '
    'Для восстановления режима ТТР ГТС выполнен пуск ГПА ст.№_ за __час(ов)__минут.'
)
